In [1]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt

In [3]:
data = pd.read_csv("titanic.csv")

In [4]:
data.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [5]:
data.shape

(891, 12)

In [6]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
PassengerId    891 non-null int64
Survived       891 non-null int64
Pclass         891 non-null int64
Name           891 non-null object
Sex            891 non-null object
Age            714 non-null float64
SibSp          891 non-null int64
Parch          891 non-null int64
Ticket         891 non-null object
Fare           891 non-null float64
Cabin          204 non-null object
Embarked       889 non-null object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [7]:
data.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

In [9]:
columns_to_drop = ["PassengerId", "Name", "Ticket", "Cabin", "Embarked"]

In [10]:
data_clean = data.drop(columns=columns_to_drop)

In [11]:
data_clean

     Survived  Pclass     Sex   Age  SibSp  Parch     Fare
0           0       3    male  22.0      1      0   7.2500
1           1       1  female  38.0      1      0  71.2833
2           1       3  female  26.0      0      0   7.9250
3           1       1  female  35.0      1      0  53.1000
4           0       3    male  35.0      0      0   8.0500
..        ...     ...     ...   ...    ...    ...      ...
886         0       2    male  27.0      0      0  13.0000
887         1       1  female  19.0      0      0  30.0000
888         0       3  female   NaN      1      2  23.4500
889         1       1    male  26.0      0      0  30.0000
890         0       3    male  32.0      0      0   7.7500

[891 rows x 7 columns]

In [12]:
from sklearn.preprocessing import LabelEncoder
le = LabelEncoder()

In [14]:
data_clean['Sex'] =  le.fit_transform(data_clean['Sex'])

In [15]:
data_clean

     Survived  Pclass  Sex   Age  SibSp  Parch     Fare
0           0       3    1  22.0      1      0   7.2500
1           1       1    0  38.0      1      0  71.2833
2           1       3    0  26.0      0      0   7.9250
3           1       1    0  35.0      1      0  53.1000
4           0       3    1  35.0      0      0   8.0500
..        ...     ...  ...   ...    ...    ...      ...
886         0       2    1  27.0      0      0  13.0000
887         1       1    0  19.0      0      0  30.0000
888         0       3    0   NaN      1      2  23.4500
889         1       1    1  26.0      0      0  30.0000
890         0       3    1  32.0      0      0   7.7500

[891 rows x 7 columns]

In [16]:
data_clean.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 7 columns):
Survived    891 non-null int64
Pclass      891 non-null int64
Sex         891 non-null int64
Age         714 non-null float64
SibSp       891 non-null int64
Parch       891 non-null int64
Fare        891 non-null float64
dtypes: float64(2), int64(5)
memory usage: 48.9 KB

In [20]:
data_clean['Age'].median()

28.0

In [22]:
data_clean['Age'] = data_clean['Age'].fillna(value= data_clean['Age'].median())

In [23]:
data_clean.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 7 columns):
Survived    891 non-null int64
Pclass      891 non-null int64
Sex         891 non-null int64
Age         891 non-null float64
SibSp       891 non-null int64
Parch       891 non-null int64
Fare        891 non-null float64
dtypes: float64(2), int64(5)
memory usage: 48.9 KB

In [30]:
input_cols = ["Pclass", "Sex", "Age", "SibSp", "Parch", "Fare"]
output_cols = ['Survived']

In [33]:
X = data_clean[input_cols]
y = data_clean[output_cols]

### Entropy

In [91]:
def entropy(col):
#     unq, counts = np.unique(col, return_counts = True)
#     N = float(np.sum(counts))
    
#     ent = 0.0
    
#     for i in range(len(unq)):
#         p = counts[i]/N
#         ent += p*np.log2(p)
        
    
    unq, counts= np.unique(col, return_counts=True)
    probabs = counts/ np.sum(counts)
    ent  = np.sum(probabs * np.log2(probabs))
    
    return -ent

In [92]:
def divide_data(x_data, fkey, fval):
    x_right = pd.DataFrame([], columns= x_data.columns)
    x_left =  pd.DataFrame([], columns= x_data.columns)
    
    
    for i in range(x_data.shape[0]):
        val = x_data[fkey].loc[i]
        
        if val>=fval:
            x_right = x_right.append(x_data.loc[i])
        else:
            x_left = x_left.append(x_data.loc[i])
            
    return x_left, x_right

In [93]:
divide_data(data_clean[:10],'Sex', data_clean[:10]['Sex'].mean() )

(   Survived  Pclass  Sex   Age  SibSp  Parch     Fare
 1       1.0     1.0  0.0  38.0    1.0    0.0  71.2833
 2       1.0     3.0  0.0  26.0    0.0    0.0   7.9250
 3       1.0     1.0  0.0  35.0    1.0    0.0  53.1000
 8       1.0     3.0  0.0  27.0    0.0    2.0  11.1333
 9       1.0     2.0  0.0  14.0    1.0    0.0  30.0708,
    Survived  Pclass  Sex   Age  SibSp  Parch     Fare
 0       0.0     3.0  1.0  22.0    1.0    0.0   7.2500
 4       0.0     3.0  1.0  35.0    0.0    0.0   8.0500
 5       0.0     3.0  1.0  28.0    0.0    0.0   8.4583
 6       0.0     1.0  1.0  54.0    0.0    0.0  51.8625
 7       0.0     3.0  1.0   2.0    3.0    1.0  21.0750)

### Information gain

In [94]:
def information_gain(x_data,  fkey, fval):
    left, right = divide_data(x_data, fkey, fval)
    
    # left total points and right total points
    l = float( left.shape[0] / x_data.shape[0] ) 
    r = float( right.shape[0] / x_data.shape[0] )
    
    IG = entropy(x_data['Survived'])  - ( l*entropy(left['Survived']) + r*entropy(right['Survived']))
    
    return IG

In [95]:
X.columns

Index(['Pclass', 'Sex', 'Age', 'SibSp', 'Parch', 'Fare'], dtype='object')

In [96]:
for col in X.columns:
    ig = information_gain(data_clean, col, data_clean[col].mean() )
    print(col , ig)

Pclass 0.07579362743608165
Sex 0.2176601066606142
Age 0.0008836151229467681
SibSp 0.009584541813400071
Parch 0.015380754493137694
Fare 0.042140692838995464

## Decision Tree Class